SuperPower/app/views/powers/show.html.erb

SELECT "powers".* FROM "powers"
---

<p> <%= Power.all.select {|power| power.name == self.name }.map {|power| power.rating }.reduce(:+) / Power.all.select {|power| power.name == self.name }.count %> </p>