SuperPower/app/controllers/powers_controller.rb

    def index
        @powers = Power.all
---
SELECT "powers".* FROM "powers"

    def show
        @power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @power = Power.create(create_power_params)
---
INSERT INTO "powers" ("name", "reason", "rating", "already_exists", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "jacob"], ["reason", "to be jacob"], ["rating", 2], ["already_exists", 1], ["created_at", "2020-12-15 17:56:47.856616"], ["updated_at", "2020-12-15 17:56:47.856616"]]

    def edit
        @power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
        @power = Power.find(params[:id])
        @power.update(update_power_params)
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "powers" SET "reason" = ?, "rating" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["reason", "to control all the animals"], ["rating", 1], ["updated_at", "2020-12-15 20:08:44.213054"], ["id", 3]]

    def destroy
        @power = Power.find(params[:id])
        @power.destroy
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "powers" WHERE "powers"."id" = ?  [["id", 14]]